using static System.Net.Mime.MediaTypeNames;

namespace Order.Models
{
    public class DbInitializer
    {
        public static void ShopData(AppDbContext context)
        {
            if (context.Shops.Any())
            {
                return;
            }
            context.AddRange(
                       new Shop
                       {
                           ShopName = "南京",
                           ShopDescription = "南京，古称金陵、建康，有“六朝古都”、“十朝都会”之称",
                           Address = "江苏-六朝古都",
                           ShopIntro = "南京，简称“宁”，古称金陵、建康，是江苏省省会、副省级市、南京都市圈核心城市，国务院批复确定的中国东部地区重要的中心城市、全国重要的科研教育基地和综合交通枢纽。全市下辖11个区，总面积6587km²。南京是中国四大古都、首批国家历史文化名城 ，是中华文明的重要发祥地，历史上曾数次庇佑华夏之正朔，是四大古都中唯一未做过异族政权首都的古都，有“六朝古都”、“十朝都会”之称。",
                           ShopImgurl = "~/images/Home/nanjing.jpeg"
                       },
                       new Shop
                       {
                           ShopName = "泰州",
                           ShopDescription = "泰州，秦称海阳，为苏中门户，自古有“水陆要津，咽喉据郡”之称",
                           Address = "江苏-汉唐古郡",
                           ShopIntro = "泰州，江苏的一颗璀璨明珠，位于长江北岸，拥有2100多年的建城史。作为水陆交通要冲，素有“水陆要津，咽喉据郡”之称。这里风景秀丽，人文荟萃，是名副其实的文化之乡、生态之城。历史长河中，泰州涌现出众多的文人墨客和英雄豪杰。从古至今，这里孕育了独特的戏曲文化，其中以泰剧最为著名。此外，泰州的早茶文化也颇负盛名，美味可口的小笼包、蟹黄汤包等特色小吃令人回味无穷。",
                           ShopImgurl = "~/images/Home/taizhou.png"
                       },
                       new Shop
                       {
                           ShopName = "连云港",
                           ShopDescription = "连云港市，古称海州",
                           Address = "江苏-淮口巨镇",
                           ShopIntro = "江苏省辖地级市，Ⅱ型大城市，是新亚欧大陆桥东方桥头堡，中国首批沿海开放城市，全国性综合交通枢纽，“一带一路”交汇点强支点城市 。位于中国沿海中部，东濒黄海，西与徐州市、宿迁市相连，南与淮安市和盐城市毗邻，北与山东省日照市、临沂市相邻；截至2022年，全市下辖3个区、3个县，土地面积7615平方千米，海域7516平方千米，常住人口460.05万人。 连云港市是江苏省历史文化名城、海上丝绸之路申遗城市。",
                           ShopImgurl = "~/images/Home/lianyungang.jpeg"
                       },
                       new Shop
                       {
                           ShopName = "上饶",
                           ShopDescription = "上饶，古称信州、广信，自古就有“上乘富饶、生态之都“、“八方通衢”和“豫章第一门户”之称",
                           Address = "江西-豫章第一门户",
                           ShopIntro = "上饶位于江西省的东北部，具有丰富历史文化底蕴和自然风光的小众城市。从唐代开始，一直是赣闽浙三省交界处的经济、文化、军事要地。到上饶，去看中国最美乡村之一婺源、广信区的灵山、望仙谷，铅山的道教文化葛仙村等；上饶特色产品有：铅山烫粉、弋阳年糕、灯盏粿、土生土长的葛粉、广丰马家柚。",
                           ShopImgurl = "~/images/Home/shangrao.png"
                       });

            context.SaveChanges();
        }

        public static void FoodData(AppDbContext context)
        {
            if (context.Foods.Any())
            {
                return;
            }
			context.AddRange(
				  new Food
				  {
					  FoodName = "南京盐水鸭",
					  SaleNum = 306,
					  SaleRank = "★★★★★",
					  FoodPrice = "58/份",
					  FoodIntro = "盐水鸭是南京著名的特产，属金陵菜，是金陵菜的代表之一，又叫桂花鸭，是中国地理标志产品。因南京有\"金陵”别称，故也称“金陵盐水鸭”，久负盛名，至今已有两千五百多年历史。南京盐水鸭制作历史悠久，积累了丰富的制作经验。生产的盐水鸭鸭皮白肉嫩肥而不腻，香鲜味美，具有香、酥、嫩的特点。而以中秋前后，桂花感开季节制作的的水鸭色味最佳，名为桂花鸭。\r\n1、外在感官特征:外形饱满，体表光洁;皮油润，白中泛黄，肌肉切面呈微红色，质地有弹性，脂肪呈浅黄色，口感威淡适中，清淡爽口:香醇可口，味似桂花。回味持久:肉质鲜嫩，嫩而不柴，久食不腻。\r\n2、内在品质指标: 水分含量s75.0%; 蛋白质含量219.0%; 脂肪含量s20.0%.\r\n3、安全要求:南京盐水鸭原料要求按照无公害农产品标准执行，加工严格按照《南京盐水鸭加工工艺规范》要求执行。",
					  FoodPic = "/images/Seller/S1.jpeg",
					  ShopId = 1
				  },
					new Food
					{
						FoodName = "南京烤鸭",
						SaleNum = 342,
						SaleRank = "★★★★★",
						FoodPrice = "88/份",
						FoodIntro = "南京烤鸭是南京的传统名菜，属金陵菜，又称金陵烤鸭。南京人吃烤鸭，讲究皮酥肉嫩，肥而不腻，所以南京烤鸭皮脆肉嫩，没有其它地区的烤鸭肥腻。但是真正的行家，却十分挑剔店里奉送的那一兜红卤。店里鸭子烤得好不好，大抵看看卖相便可以揣测出来，但老卤对不对味，却非得口舌亲尝方知。南京人的口味喜好小糖醋，讲究略甜微酸，鲜咸适度。调制这样的味汁，功夫不比烤鸭差，明炉烤鸭在鸭腔子里面必得灌水。外烤内煮，一旦鸭肉熟了，这一包汁水也鲜透。趁热把酒酿蜜卤倒进汤汁，浇上糖色﹑米醋﹑精盐，考究起来加一滴酱油都不算本事，端出去的红汤老卤才叫地道。",
						FoodPic = "/images/Seller/S2.jpeg",
						ShopId = 1
					},
					  new Food
					  {
						  FoodName = "鸭血粉丝汤",
						  SaleNum = 478,
						  SaleRank = "★★★★★",
						  FoodPrice = "28/份",
						  FoodIntro = "鸭血粉丝汤是南京的传统名菜，属金陵菜，是金陵菜和金陵小吃中重要的代表，也是久负盛名以鸭为特色的美食之一。鸭血粉丝汤由鸭血、鸭肠、鸭肝等加入鸭汤和粉丝制成，以其口味平和，鲜香爽滑的特点与南北皆宜的口味特色，风靡于全国各地。南京人自古喜食鸭馔，盛行以鸭制肴，有“金陵鸭肴甲天下”之美誉。鸭血粉丝汤为迎合各地饮食特色而进行改良，在制作时，各地均有不同，不过不论是鸭汤的烹制，还是鸭血、鸭肝与鸭肠的制作，都采用的是传统制作金陵盐水鸭的方法，是金陵菜中重要的代表。南京是出了名的\"鸭都\"。南京鸭血粉丝汤以整鸭熬汤，鸭血的滑嫩、鸭胗的柔韧、鸭肠的爽滑、鸭肝的绵软、鸭汤的清鲜，再配上Q弹有嚼劲的粉丝，吃一口永远忘不了。",
						  FoodPic = "/images/Seller/S3.jpeg",
						  ShopId = 1
					  },
						new Food
						{
							FoodName = "金陵汤包",
							SaleNum = 589,
							SaleRank = "★★★★★",
							FoodPrice = "25/份",
							FoodIntro = "金陵汤包是南京的传统特色美食，属金陵菜、金陵小吃，以汤多为主要特点。以“小巧、皮薄、馅大、肉鲜、味美、汤汁充盈、清香利口”而著称。比较著名的有南京的鸡鸣汤包、尹氏汤包、龙袍蟹黄汤包等。汤包的特点：做工精细，小巧玲珑，皮薄，馅多、虾肉、蟹肉，不论是哪一种馅，都咸淡适中，清淡爽口。每一小笼内一般放十个汤包，用松针铺底，不粘皮、又清香，端上桌后，观其形、闻其味，食欲大增，咬开皮，包内有少许油水，故称“汤包”。",
							FoodPic = "/images/Seller/S4.png",
							ShopId = 1
						},
						  new Food
						  {
							  FoodName = "梅花糕",
							  SaleNum = 596,
							  SaleRank = "★★★★",
							  FoodPrice = "7/份",
							  FoodIntro = "梅花糕是江苏南京的一种著名的风味特色小吃。源于明朝，发展到清朝时就成为江南地区最著名的传统特色糕类小吃。因其形如梅花，便赐名梅花糕，流传。梅花糕和海棠糕类似，呈金黄色，松软可口，老少皆宜。梅花糕在继承了传统制作方法的同时，又加入小元宵、青红果、松子仁等，使其味道更加鲜美，外焦里嫩，而且有豆沙、果酱、果仁等十几种配制方法，用面粉、豆沙、白砂糖等十几种原料经特制炉具烘烤而成。上面的元宵“很糯”，葡萄干“很香”，里面的豆沙“很细”，熔化后白砂糖的焦香，再加上五颜六色的点缀，那有点韧劲儿的外壳包裹中的赤豆沙（或果酱），软绵的口感，浓缩的甜香味，热乎乎的夹馅愉悦口中所有待放的味蕾。",
							  FoodPic = "/images/Seller/S5.jpeg",
							  ShopId = 1
						  },
							new Food
							{
								FoodName = "什锦豆腐涝",
								SaleNum = 389,
								SaleRank = "★★★★",
								FoodPrice = "12/份",
								FoodIntro = "什锦豆腐涝是南京著名的小吃，豆腐涝在南京又称“都不老”，在南京话中就是豆腐脑、豆腐花的意思。据说，豆腐涝这玩艺，年轻人吃了健脑补脑，老年人吃了延年益寿，为了讨口彩，店家还在里面加入什锦菜，就是前程似锦的意思。南京什锦豆腐涝的特点是除了一样的和普通的豆腐脑一样色白如玉，清香爽口外。它主要讲究的是佐料，辅以虾米、榨菜、木耳、葱花、辣油、香油等十余种佐料，不光是颜色漂亮，口味更是醇、浓、香、鲜、咸淡适宜，辛辣适中，有滋有味。",
								FoodPic = "/images/Seller/S6.jpeg",
								ShopId = 1
							},
				new Food
				{
					FoodName = "赤豆元宵",
					SaleNum = 542,
					SaleRank = "★★★★",
					FoodPrice = "10/份",
					FoodIntro = "赤豆元宵是南京的特色风味小吃。赤豆元宵味儿好，看相也很好。黄色的桂花加上暗红的赤豆，再配上一颗颗雪白的元宵，宛如一碗玛瑙和一颗颗明亮的珍珠混合在了一起。莲糊是半透明的，有点泛红，粘稠稠的，让人感到很神秘。赤豆元宵的做法很简单。先把买来的上等的红豆放进锅里焖煮，接着放进珍珠般洁白的小圆宵，在元宵快要浮上来前，加进几块冰糖和几勺桂花蜜，等到元宵浮上来，就倒入一些用冷水调好的藕粉，并不停的搅动锅里的元宵，白色的藕粉，裹着洁白的元宵，逐渐变成透明的莲糊状。临吃时，再撒上一些桂花。",
					FoodPic = "/images/Seller/S7.jpeg",
					ShopId = 1
				},
				   new Food
				   {
					   FoodName = "活珠子",
					   SaleNum = 230,
					   SaleRank = "★★★★★",
					   FoodPrice = "4/份",
					   FoodIntro = "活珠子是南京著名的特产，是当鸡蛋即将孵成一个生命但是又没有完全成形，蛋里面已经有了头、翅膀、脚的痕迹，这种亦鸡亦蛋的鸡蛋孵化物叫做\"活珠子\"。\"活珠子\"是经传统孵化发育而成的鸡胚胎，因其发育中囊胚在透视状态下形如活动的珍珠，故称\"活珠子\"。活珠子是民间一大补品。具有养颜美容、保健补血等功效，其营养成分与普通鸡蛋相比，活珠子含有人体所需的8种氨基酸和婴幼儿所必需的2种氨基酸，促进婴幼儿大脑发育的牛磺酸增加近20倍，促进婴幼儿骨骼生长和防止老年骨质疏松所需的钙增加6倍多，其它营养成分均显著高于普通鸡蛋。而对人体不利的脂肪含量下降50%，胆固醇仅为原有的五分之一，实为理想的绿色食补佳品。",
					   FoodPic = "/images/Seller/S8.jpeg",
					   ShopId = 1
				   },
					  new Food
					  {
						  FoodName = "烫干丝",
						  SaleNum = 328,
						  SaleRank = "★★★★★",
						  FoodPrice = "18/份",
						  FoodIntro = "起源和历史：泰州烫干丝是江苏泰州地区的传统特色美食小吃之一。烫干丝最初被称为“泰州五味干丝”，后改名为烫干丝。材料和制作：\r\n泰州烫干丝的主要原料是专用的豆腐干，经过切丝、飘制等多个步骤制作而成。烫干丝的配料有肴肉、香菜、榨菜、香菇和姜丝等。制作过程非常繁琐，需要将豆腐干切成细丝，再用刀横着削成厚薄均匀的20多层，最后斜铺切成细丝。特点和口感：泰州烫干丝色泽素雅，软嫩异常，鲜美隽永。其口感独特，豆腐干丝软嫩，配以肴肉、香菜、榨菜、香菇和姜丝等配料，味道鲜美，香气四溢。\r\n地域和文化：泰州烫干丝是江苏泰州地区的传统特色美食小吃之一，代表了该地区的饮食文化和烹饪技艺。\r\n健康和营养：泰州烫干丝是一道健康美食，豆腐干丝是其主要原料之一，富含蛋白质和膳食纤维，肴肉、香菜等配料也富含营养成分。",
						  FoodPic = "/images/Seller/S9.jpeg",
						  ShopId = 2
					  },
						new Food
						{
							FoodName = "黄桥烧饼",
							SaleNum = 430,
							SaleRank = "★★★★★",
							FoodPrice = "6/个",
							FoodIntro = "起源和历史：黄桥烧饼是一道有着悠久历史的传统小吃，最早可以追溯到魏晋时期。经过数百年的传承和发展，黄桥烧饼已成为泰兴市，乃至江苏省的特色美食之一。黄桥烧饼的历史与当地的文化、风俗习惯和经济发展紧密相关，它不仅是美食，更是文化的传承和延续。材料和制作：黄桥烧饼的主要材料是面粉、猪油、芝麻等。制作黄桥烧饼需要经过多道工序，包括和面、制馅、包酥、制饼、烘烤等。每道工序都需要严格的操作技巧和经验，才能制作出正宗的黄桥烧饼。在制作过程中，选用优质面粉和猪油，通过独特的制作工艺，使黄桥烧饼具有独特的口感和风味。\r\n特点和口感：黄桥烧饼以其色泽金黄、香脆可口、不油不腻的特点而著名。刚出炉的黄桥烧饼外皮酥脆，内馅鲜美，香气四溢，让人食欲大增。黄桥烧饼的口感丰富，层次分明，外酥内软，营养丰富，是一道健康美味的小吃。\r\n地域和文化：黄桥烧饼是泰兴市的地方特色小吃，也是江苏省的传统美食之一。在泰兴市，黄桥烧饼已经成为当地的标志性美食，深受当地人和游客的喜爱。黄桥烧饼不仅是一种美食，更是一种文化的传承和表达。在品尝黄桥烧饼的同时，也能感受到当地的历史和文化氛围。\r\n健康和营养：黄桥烧饼采用优质原料制作而成，富含蛋白质、碳水化合物、脂肪等营养成分。此外，黄桥烧饼中的芝麻含有丰富的维生素和矿物质，有助于补充人体所需的营养素。相较于其他油炸食品，黄桥烧饼采用烘烤方式制作，减少了油脂的使用量，更加健康。适量食用黄桥烧饼可以为人体提供能量和营养，但应避免过量食用，以免对身体造成负担。",
							FoodPic = "/images/Seller/S10.jpeg",
							ShopId = 2
						},
						  new Food
						  {
							  FoodName = "蟹黄汤包",
							  SaleNum = 563,
							  SaleRank = "★★★★★",
							  FoodPrice = "28/份",
							  FoodIntro = "起源和历史：蟹黄汤包是江苏一道著名传统小吃，已有200年历史，是中华六大名点之一。馅心由大闸蟹、新鲜猪肉皮、正宗老母草鸡特制而成。各地都有蟹黄汤包，比较出名的有幸京龙袍蟹黄汤包、镇江宴春蟹黄汤包、淮安文楼蟹黄汤包等，而泰州著名的蟹黄汤包是靖江蟹黄汤包、泰兴曲霞蟹黄汤包两种。\r\n材料和制作：蟹黄汤包的馅心由大闸蟹、新鲜猪肉皮、老母草鸡特制而成。汤包皮薄，汤清不腻，稠而不油，制作很有讲究。\r\n特点和口感：蟹黄汤包以其汤包皮薄，汤清不腻，稠而不油，深受大江南北美食家的青睐。味道鲜美、皮薄汤多，口感细腻。\r\n地域和文化：蟹黄汤包起源于江苏，是中国六大名点之一。各地都有不同口味的蟹黄汤包，反映了当地的饮食文化和地域特色。\r\n健康和营养：蟹黄汤包含有大闸蟹、猪肉皮、草鸡等多种食材，含有丰富的蛋白质、脂肪、碳水化合物等营养成分，但是也要注意摄入量，不宜过量食用。",
							  FoodPic = "/images/Seller/S11.jpeg",
							  ShopId = 2
						  },
							new Food
							{
								FoodName = "蟹黄粉皮",
								SaleNum = 219,
								SaleRank = "★★★★",
								FoodPrice = "20/份",
								FoodIntro = "起源和历史：蟹黄粉皮是江苏省著名的传统小吃，起源于江苏苏州市。它最早出现在清代，是当时宫廷中的一道名菜，后来逐渐传入民间并演变成小吃。\r\n材料和制作：蟹黄粉皮的主要材料是绿豆淀粉和蟹黄，制作过程中需要将绿豆淀粉加水搅拌成糊状，再蒸熟成透明的粉皮。将蒸好的粉皮切成条状，再用蟹黄和其他调料拌匀，放在粉皮上卷起来即可。\r\n特点和口感：蟹黄粉皮色彩鲜明，蟹味浓郁，口感丰富，粉皮韧性好，口感肥厚滑爽，是一道美味可口的小吃。\r\n地域和文化：蟹黄粉皮起源于江苏苏州市，是当地的传统小吃之一。它不仅深受当地人的喜爱，也吸引了众多游客前来品尝。\r\n健康和营养：蟹黄粉皮富含蛋白质、碳水化合物和维生素，蟹黄中还含有丰富的营养物质，具有良好的营养价值。同时，由于采用蒸制的方式，相对于油炸等传统烹饪方法，其油脂含量较低，更加健康。",
								FoodPic = "/images/Seller/S12.jpeg",
								ShopId = 2
							},
							  new Food
							  {
								  FoodName = "宣堡小馄饨",
								  SaleNum = 387,
								  SaleRank = "★★★★",
								  FoodPrice = "11/份",
								  FoodIntro = "起源和历史：宣堡小馄饨是泰兴市传统名小吃，因产于千年古镇——宣堡镇而得名。它是从大馄饨（江苏地区又称扁食）发展而来，形成至今已有近百年的历史。\r\n材料和制作：小馄饨的面皮薄似宣纸，几近透明，可以用火柴点燃。它的馅料嫩滑，汤鲜味美，制作技艺被列入了泰州市第二批非物质文化遗产保护项目。\r\n特点和口感：宣堡小馄饨的皮薄馅嫩、味美汤鲜等特点深受广大消费者喜爱。\r\n地域和文化：宣堡小馄饨产于千年古镇——宣堡镇，是泰兴市的传统名小吃之一，与银杏、糖生姜丝并称为“泰兴三宝”。中央电视台曾拍摄《宣堡小馄饨》专题片。\r\n健康和营养：宣堡小馄饨是一种传统手工制作的小吃，以瘦肉和蔬菜为主要食材，健康营养。",
								  FoodPic = "/images/Seller/S13.jpeg",
								  ShopId = 2
							  },
								new Food
								{
									FoodName = "靖江肉脯",
									SaleNum = 476,
									SaleRank = "★★★★",
									FoodPrice = "26/份",
									FoodIntro = "起源和历史：靖江猪肉脯是靖江市的一道传统名吃，也是泰州著名的特产小吃。始创于1936年，选料精细，采用传统工艺，配以多种天然香料，经过十多道工序精心加工而成。\r\n材料和制作：靖江猪肉脯以猪腿肉为主要食材，菜品色泽棕红，光泽美观，口味香甜，食而不腻，成品为片型。\r\n特点和口感：靖江猪肉脯色泽鲜艳，味道鲜美，食用方便，回味无穷。它的风味独特，口感酥脆，咀嚼时肉质柔软，入口即化，且带有一定的咸香味道。\r\n地域和文化：靖江猪肉脯是靖江市的传统名吃，也是泰州市的特产小吃之一，享有盛誉。它的制作历史悠久，技艺精湛，是靖江市的一项非物质文化遗产。\r\n健康和营养：靖江猪肉脯富含蛋白质和多种营养成分，是一种高蛋白、低脂肪的健康食品。适量食用可以补充人体所需的营养，并有助于增强体质。但由于含有一定量的盐分和糖分，故不宜过量食用。",
									FoodPic = "/images/Seller/S14.jpeg",
									ShopId = 2
								},
								new Food
								{
									FoodName = "鱼汤面",
									SaleNum = 504,
									SaleRank = "★★★★★",
									FoodPrice = "14/份",
									FoodIntro = "起源和历史：泰州鱼汤面是泰州著名的传统面食，已有几百年的历史。它的起源可以追溯到明代，当时泰州的渔民们将自己捕获的鲜鱼制成鱼汤，再用面条煮熟，形成了这道美食。\r\n材料和制作：泰州鱼汤面的制作需要用到新鲜的鲤鱼或草鱼等淡水鱼，以及面粉、葱姜蒜等辅料。先将鲜鱼清洗干净，切成小块，再加入葱姜蒜等调料，在锅中煮熟成鱼汤。面条则是用高筋面粉和水调制成面团，揉搓成细条，放入开水中煮熟。\r\n特点和口感：泰州鱼汤面的特点在于鱼汤清香鲜美，面条爽滑有弹性，口感十分丰富。配上葱姜蒜等调料，味道更加浓郁。\r\n地域和文化：泰州鱼汤面是泰州地区的传统美食，反映了当地的饮食文化和地域特色。在泰州，鱼汤面是一道非常受欢迎的美食，各大餐馆和小摊贩都会出售。\r\n健康和营养：泰州鱼汤面的鱼汤富含蛋白质和微量元素，面条也是一种碳水化合物，含有一定的营养成分。但是要注意选择新鲜的鱼和面粉，并控制食用量，以免过量摄入。",
									FoodPic = "/images/Seller/S15.jpeg",
									ShopId = 2
								},
								new Food
								{
									FoodName = "姜堰酥饼",
									SaleNum = 327,
									SaleRank = "★★★★",
									FoodPrice = "5/个",
									FoodIntro = "起源和历史：姜堰酥饼是江苏泰州姜堰地区传统饼类名小吃，四季都能吃到的点心。制作历史悠久，是江苏省泰州市姜堰区的特色小吃。\r\n材料和制作：姜堰酥饼的制作很有讲究，油酥面团卷成多层次的圆柱形，横断数截，垂直拍扁，擀成饼坯。两片饼坯之间夹以火腿、笋丁、鸡丁、虾仁等所制馅心，油炸成熟。\r\n特点和口感：姜堰酥饼色泽诱人，口感香酥可口，层次丰富，花纹清晰，鱼泽金黄，酥脆味香。\r\n地域和文化：姜堰酥饼起源于江苏泰州姜堰地区，是当地的特色小吃。其制作工艺独特，反映了当地的饮食文化和地域特色。\r\n健康和营养：姜堰酥饼油炸成熟，含有较高的油脂成分，不宜过量食用。",
									FoodPic = "/images/Seller/S16.jpeg",
									ShopId = 2
								},
									new Food
									{
										FoodName = "豆腐卷",
										SaleNum = 325,
										SaleRank = "★★★",
										FoodPrice = "1/个",
										FoodIntro = "豆腐卷是以豆皮、金针菇、韭菜、胡萝卜、黄瓜、豆芽为原料制成的一种美食。将豆腐皮切小，其他蔬菜切小。锅里水烧开（放一点盐），分别氽烫所有食材，然后用豆腐皮包住所有蔬菜，用韭菜打结固定即可。\r\n\r\n",
										FoodPic = "/images/Seller/S17.png",
										ShopId = 3
									},
										new Food
										{
											FoodName = "朝牌",
											SaleNum = 305,
											SaleRank = "★★★★",
											FoodPrice = "2/个",
											FoodIntro = "朝牌，一种民间食品，因形状似古代官员上朝时手持的朝圣的牌子而得名·其制作方法是：将发好的面碾成薄片，抹上素油和芝麻，然后贴在专门的烤炉内烤熟·烤一定时间，达到脆硬的状态，这样香喷喷的朝牌便做好了·\r\n\r\n",
											FoodPic = "/images/Seller/S18.png",
											ShopId = 3
										},
											new Food
											{
												FoodName = "蒸糕",
												SaleNum = 265,
												SaleRank = "★★★",
												FoodPrice = "15/斤",
												FoodIntro = "蒸糕是中国传统糕点之一，以面粉和鸡蛋为主要原料。需要将蛋清与蛋黄分开，把蛋清打发，蛋黄则和面粉混和拌匀，最后把打发的蛋清加入蛋黄和面粉里放到锅里蒸熟即可。\r\n\r\n\r\n",
												FoodPic = "/images/Seller/S19.png",
												ShopId = 3
											},
											 new Food
											 {
												 FoodName = "凉皮",
												 SaleNum = 399,
												 SaleRank = "★★★★★",
												 FoodPrice = "8/份",
												 FoodIntro = "其流行于中国北方地区，是不可多得的天然绿色无公害食品。因原料、制作方法、地域不同，有热米（面）皮、擀面皮、烙面皮、酿皮等。口味有麻辣，酸甜，香辣等各种口味。 凉皮历史悠久，据说源于秦始皇时期，距今已有两千多年历史。\r\n\r\n",
												 FoodPic = "/images/Seller/S20.jpeg",
												 ShopId = 3
											 },
											  new Food
											  {
												  FoodName = "糖稀",
												  SaleNum = 156,
												  SaleRank = "★★★",
												  FoodPrice = "15/份",
												  FoodIntro = "饴糖是由玉米、大麦、小麦、粟或玉蜀黍等粮食经发酵糖化而制成的食品。它也是一味传统中药，性味甘、温，归脾、胃、肺经，临床主要用来补脾益气、缓急止痛、润肺止咳，治疗脾胃气虚、中焦虚寒、肺虚久咳、气短气喘等，在多个经方中皆有应用。另外饴糖还具有一定的还原性，可以抗氧化，具有较大的渗透压，能抑制制剂中微生物的生长繁殖[1]。\r\n",
												  FoodPic = "/images/Seller/S21.png",
												  ShopId = 3
											  },
											   new Food
											   {
												   FoodName = "棉花糕",
												   SaleNum = 199,
												   SaleRank = "★★★",
												   FoodPrice = "20/份",
												   FoodIntro = "棉花糕是一道传统特色糕类小吃，美食街发掘该店解放前“广记”松糕的传统小吃加以创新发掘起来的。主要原料采用精选大米磨浆，加上乘白糖经传统方法蒸制而成。棉花糕又名大发松过年、喜庆糕，是连云港人的必备食品。\r\n\r\n",
												   FoodPic = "/images/Seller/S22.png",
												   ShopId = 3
											   },
												new Food
												{
													FoodName = "豆丹",
													SaleNum = 150,
													SaleRank = "★★★★",
													FoodPrice = "198/斤",
													FoodIntro = "豆丹其实是江苏连云港地区的一种昆虫,就是大青虫。大青虫,又名豆丹、青豆丹,是一种直翅目昆虫。它体型较大,呈绿豆状,飞行时发出嗡嗡声音,常聚集在树上或灯光旁,喜食植物叶片。大青虫营养丰富,含有丰富的蛋白质、脂肪、维生素及钙、铁等矿物质,是连云港地区的特色食用昆虫之一。\r\n",
													FoodPic = "/images/Seller/S23.png",
													ShopId = 3
												},
												 new Food
												 {
													 FoodName = "凤鹅",
													 SaleNum = 300,
													 SaleRank = "★★★★★",
													 FoodPrice = "200/只",
													 FoodIntro = "花果山风鹅，江苏省灌云县特产，中国国家地理标志产品。[1]\r\n花果山风鹅采用源自江苏省最大的绿色天然无公害牧场——万顷草场沂河淌的绿色鹅源，在沂河淌特定的特定自然环境和饲养条件下，花果山风鹅形成了生长速度较慢、肉质优良、风味独特等特点，是理想的不饱和脂肪酸和蛋白质来源，其口感、风味具有灌云县鲜明的地域特色。花果山风鹅呈酱黄色，皮薄，肉质致密，有嚼劲，老嫩适中。\r\n",
													 FoodPic = "/images/Seller/S24.png",
													 ShopId = 3
												 },
												  new Food
												  {
													  FoodName = "酒糟鱼",
													  SaleNum = 352,
													  SaleRank = "★★★★★",
													  FoodPrice = "25/斤",
													  FoodIntro = "酒糟鱼是一客闲菜，你可不喝酒，也不吃饭，就着一盘酒糟鱼，精雕细琢地吃，潜心着意地品，那深深江湖询问的水声，那世事的沧桑、美好，便从酒糟鱼的肉质里湿润出来。\r\n一、特色\r\n产品选用亚洲第一大无污染的淡水湖鄱阳湖所产活鲜青，草鱼和上乘糯米，小磨麻油为原料，辅以十多种天然香料，经科学腌制、糟制、煮蒸、真空包装、高温杀菌精制而成，为天然绿色食品。肉质肥美，鱼肉入味，去头去尾最大程度的保留鱼肉；咬一口香甜入味，不需吐骨头，满满一袋鱼肉。\r\n二、营养价值\r\n富含蛋白质、钙、铁、22碳6烯酸等营养成份。曾获得中国星火计划国际研讨会金奖，并被全国新产品推荐委员会评为“国家特产精品”。\r\n",
													  FoodPic = "/images/Seller/S25.png",
													  ShopId = 4
												  },
												   new Food
												   {
													   FoodName = "铅山米粉",
													   SaleNum = 568,
													   SaleRank = "★★★★★",
													   FoodPrice = "6/份",
													   FoodIntro = "铅山烫粉是流行于江西省上饶市境内的一道传统特色小吃，因其发源于铅山县永平镇境内，故得名铅山烫粉。\r\n一、做法\r\n铅山烫粉是由经过开水涮烫后的米粉，可以凉拌米粉、炒煮米粉，放入姜沫、蒜沫、麻油、酱油、猪油、葱花、咸菜沫等佐料后而成。\r\n二、特点\r\n铅山烫粉具有熟而脆，香而不腻的特点，集鲜、香、辣、滑于一身，有弹。主要制作原料是优质晚米。制作铅山米粉要经过浸米、磨浆、滤干、采浆等多道工序。\r\n",
													   FoodPic = "/images/Seller/S26.png",
													   ShopId = 4
												   },
												new Food
												{
													FoodName = "上饶鸡腿",
													SaleNum = 246,
													SaleRank = "★★★★",
													FoodPrice = "11/个",
													FoodIntro = "上饶鸡腿是江西省上饶地区特色小吃，使用上饶当地山里野鸡的特大鸡腿，根据传统工艺，釆用现代食品科技精心研制的鼎新产品，食之骨酥肉韧，香辣开胃，是佐餐，下酒，休闲及馈赠亲友的美食佳品。\r\n一、做法\r\n上饶鸡腿的配料有鸡腿，辣椒，味精，山梨酸钾，香辛料等，其生产工艺包括卤制、烘烤、入味、删选、包装等诸多环节，通常完成这一过程需时36小时以上。\r\n二、特点\r\n上饶鸡腿使用上饶一带的山区野鸡制作而成，味道鲜美，是上饶火车站的主推特产。上饶山鸡腿通常采用简易的袋装包装，具有简单、携带方便、价格适宜等特点。在上饶火车站、汽车站等地可以随时购买到新鲜的野生山鸡腿。\r\n",
													FoodPic = "/images/Seller/S27.png",
													ShopId = 4
												},
												  new Food
												  {
													  FoodName = "茄子干",
													  SaleNum = 180,
													  SaleRank = "★★★★",
													  FoodPrice = "13/斤",
													  FoodIntro = "茄子干是江西省赣东北（鹰潭市、贵溪市、鄱阳县、上饶市等地）的特色小吃，它集香、辣、甜、咸多种味道为一体，口感既韧又软，且有过口忘不了。\r\n一、做法\r\n主要原料：茄子，糯米；辅助原料：甜酒曲、白糖、盐、味精、辣椒干、大蒜。\r\n二、食用方法\r\n切细条，直接食用，可做零食。\r\n三、特色\r\n皮酱褐色、芯酱红色、有特别的香味，口感软、甜、咸、鲜、辣、香集为一体。\r\n",
													  FoodPic = "/images/Seller/S28.png",
													  ShopId = 4
												  },
													new Food
													{
														FoodName = "灯盏粿",
														SaleNum = 300,
														SaleRank = "★★★★",
														FoodPrice = "12/份",
														FoodIntro = "灯盏粿是江西省上饶市的地方特色小吃。因外形呈灯盏状而得名\r\n一、做法\r\n灯盏粿原料是普通的大米，用石磨磨成浆，然后放在锅里熬成粿胚，再捏成灯盏形，中间添馅，馅大多数有新鲜香菇，鲜猪肉，黄豆芽，鲜竹笋等，最后放入竹制小蒸笼中用大火蒸半小时左右即可。\r\n二、特点\r\n灯盏粿因外形呈灯盏状而得名，适用人群是老少皆宜，具有鲜、香、辣的特点，食后回味无穷，齿颊留香。\r\n",
														FoodPic = "/images/Seller/S29.png",
														ShopId = 4
													},
													  new Food
													  {
														  FoodName = "弋阳年糕",
														  SaleNum = 253,
														  SaleRank = "★★★★★",
														  FoodPrice = "6/斤",
														  FoodIntro = "弋阳年糕，又名弋阳大禾米粿，产于江西省上饶市的特产美食。弋阳年糕制作始于唐代，已有1200多年的历史，它以弋阳大禾谷米为原料，采用“三蒸两百锤”的独特工艺制作而成，以白洁玉润、柔韧爽滑而着称。\r\n一、做法\r\n根据个人喜好，均可以炒、蒸、煮、炖等多种做法。\r\n二、特点\r\n以大禾米为原料，采用“三蒸二百锤”的独特工艺，制作出的年糕具有洁白如霜、透明如玉、口感爽滑、韧性可口、不粘不腻、久煮不糊的特点。\r\n1、感官特色：色泽为白带微黄、油质发亮、微透明，略带米质清香，无酸味、霉味及其它异味，煮后不糊，不粘牙，柔软爽滑，韧性适口。\r\n2、理化指标：水份≤50%，酸度≤5.0（0.1NNaOHm1/10克），白度≥40%（452纳米蓝色反射率），吐浆度≤4.0%，烹饪性能良好。\r\n",
														  FoodPic = "/images/Seller/S30.png",
														  ShopId = 4
													  },
													   new Food
													   {
														   FoodName = "横峰葛粉",
														   SaleNum = 210,
														   SaleRank = "★★★★★",
														   FoodPrice = "58/斤",
														   FoodIntro = "横峰是“中国葛之乡”，种葛历史悠久，种植、加工技术成熟，葛源葛粉因风味独特曾被作为贡品。具有极为丰富的营养成分，是老少皆宜的名贵滋补品，有“千年人参”之美誉。\r\n一、做法\r\n冲泡，调匀后的葛粉用沸开水冲泡后，即成可食用的可口食品了，可加适量的冰糖调味。冲泡后就变成了均匀、细腻、可口、深褐透明色油态物，汤匙从中取起时象从食用油中取出一样，液态物象滴油一样一滴一滴很下滑。（一般的淀粉冲泡后颜色为浅黄带白，透明度不高，且有块状，会粘在碗或匙上。）\r\n二、特点\r\n葛粉是从藤本植物葛根中提取出来的一种纯天然营养佳品，它具有清热解毒、生津止渴、补肾健脾、益胃安神、清心明目、润肠道便及醒酒等功能。\r\n",
														   FoodPic = "/images/Seller/S31.png",
														   ShopId = 4
													   },
														new Food
														{
															FoodName = "广丰马家柚",
															SaleNum = 351,
															SaleRank = "★★★★★",
															FoodPrice = "35/斤",
															FoodIntro = "广丰马家柚是红心柚的一个品种，于2009年12月通过江西省农作物品种审定委员会认定，是中国主要的八大柚类之一。这款品质卓越的柚子，凭借其独特的口感和丰富的营养价值，成为了水果世界的一股清流。\r\n一、特点：\r\n1、单糖含量多，蔗糖含量低，低糖低酸，果味清香。\r\n2、汁多水足，出汁率高达52.7%，甚至高于用于果汁加工的品种。\r\n3、营养丰富，果肉红色，富含番茄红素23.5微克/gFW；富含17种不同的氨基酸和铁、铜、锌等微量元素。\r\n二、作用与功效\r\n富含维生素C、葡萄糖、蔗糖、类黄酮、矿物质和柚皮素等，有助于增强免疫力、降低胆固醇、保护心脏健康等多种功效。\r\n",
															FoodPic = "/images/Seller/S32.png",
															ShopId = 4
														});
			context.SaveChanges();
		}
	}
}






